app/views/admin/items/new.html.erb

SELECT "genres".* FROM "genres"
---
        <h4>ジャンル</h4>
        <%= t.select :genre_id, options_from_collection_for_select(Genre.all, :id, :name) %>