app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.page(params[:page]).reverse_order
---
SELECT  "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    @customer = Customer.find(params[:id])
    @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "postal_code" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["postal_code", "12300001"], ["updated_at", "2022-02-03 12:32:13.421366"], ["id", 3]]