app/controllers/admin/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ケーキ"], ["created_at", "2021-10-24 06:06:36.306764"], ["updated_at", "2021-10-24 06:06:36.306764"]]

  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "ケーキa"], ["updated_at", "2021-10-24 07:15:41.197607"], ["id", 1]]