app/controllers/admin/homes_controller.rb

  def top
    @orders_details = OrderDetail.all.page(params[:page]).per(10)
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]