app/controllers/admin/items_controller.rb

INSERT INTO "items" ("name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "イタリアンショートケーキ"], ["image_id", nil], ["introduction", "a"], ["price", 300], ["is_active", "t"], ["created_at", "2021-10-27 10:54:59.413422"], ["updated_at", "2021-10-27 10:54:59.413422"]]
---
  def create
    @items = Items.new(items_params)
    @items.save

SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.page(params[:page]).reverse_order

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", nil], ["introduction", "ab"], ["updated_at", "2021-11-14 08:38:31.412185"], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    @item.update(item_params)