app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "order_active" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_active", 2], ["updated_at", "2021-12-06 12:43:43.498260"], ["id", 1]]
---
  def update
    @order = Order.find(params[:id])
    @order.update(orders_params)