app/controllers/admin/orders_details_controller.rb

SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 1], ["updated_at", "2021-12-06 13:03:44.450783"], ["id", 1]]
---
  def update
    @orders_detail = OrderDetail.find(params[:id])
    @order = @orders_detail.order
    @orders_detail.update!(orders_detail_params)