app/views/admin/orders/show.html.erb

          <tbody>
            <% @order.order_details.each do |d| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]