app/controllers/public/addresses_controller.rb

INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 8], ["name", "太郎"], ["postal_code", "111111"], ["address", "aaaaaa"], ["created_at", "2021-11-13 11:58:54.111578"], ["updated_at", "2021-11-13 11:58:54.111578"]]
---
  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "1111112"], ["updated_at", "2022-01-24 10:02:13.758935"], ["id", 4]]
---
  def update
    @address = Address.find(params[:id])
    @address.update!(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy