app/controllers/public/cart_items_controller.rb

INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 8], ["amount", 1], ["created_at", "2021-11-13 08:46:58.973846"], ["updated_at", "2021-11-13 08:46:58.973846"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.save!

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2021-11-13 08:53:29.611553"], ["id", 6]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 9]]
---
  def all_destroy
    current_customer.cart_items.destroy_all