app/controllers/public/items_controller.rb

SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @items = Item.all.page(params[:page]).per(8)