app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def log
    @order = current_customer.orders.new
    @order.payment_method = params[:order][:payment_method]
    @order.postage = 800
    @cart_item = current_customer.cart_items
    if params[:order][:address_method] == "1"
      @order.name = current_customer.first_name + current_customer.last_name

INSERT INTO "orders" ("customer_id", "addresses", "name", "payment_method", "postage", "billing_amount", "created_at", "updated_at", "postal_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "making_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_id", 1], ["item_id", 2], ["price", 300], ["amount", 1], ["making_status", 0], ["created_at", "2021-11-23 09:12:30.359017"], ["updated_at", "2021-11-23 09:12:30.359017"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 17]]
---
  def create
    @order = Order.new(order_params)
    puts "==========="
    p @order
    @order.customer_id = current_customer.id
    @order.save
    current_customer.cart_items.each do |cart_item|
      order_detail = OrderDetail.new
      order_detail.order_id = @order.id
      order_detail.item_id = cart_item.item_id
      order_detail.price = cart_item.item.price
      order_detail.amount = cart_item.amount
      order_detail.making_status = "no_running"
      order_detail.save
    end
    current_customer.cart_items.destroy_all

SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
---
  def index
    @orders = current_customer.orders

SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? AND "orders"."id" = ? LIMIT ?  [["customer_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @order = current_customer.orders.find(params[:id])