app/views/public/orders/new.html.erb

        <%= f.label :address_method, "登録済住所から選択", value:2 %>
        <%= f.select :address_id, options_from_collection_for_select(Address.all, :id, :full_address) %>
---
SELECT "addresses".* FROM "addresses"