app/views/public/orders/show.html.erb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
        <tbody>
          <% @order.order_details.each do |order_detail| %>